**VIDEO 1**

In [2]:
import pandas as pd

In [3]:
data = {'Nombre': ['Ana', 'Luis', 'Carlos', 'Sara'],
        'Edad': [25,30,22,27],
        'Ciudad': ['Madrid', 'Barcelona', 'Valencia', 'Bilbao']}

df = pd.DataFrame(data)
df

   Nombre  Edad     Ciudad
0     Ana    25     Madrid
1    Luis    30  Barcelona
2  Carlos    22   Valencia
3    Sara    27     Bilbao

In [4]:
df['Salario'] = [30000,45000,38000,32000]
df

   Nombre  Edad     Ciudad  Salario
0     Ana    25     Madrid    30000
1    Luis    30  Barcelona    45000
2  Carlos    22   Valencia    38000
3    Sara    27     Bilbao    32000

In [5]:
df['Salario'] = df['Salario'] + 3000
df

   Nombre  Edad     Ciudad  Salario
0     Ana    25     Madrid    33000
1    Luis    30  Barcelona    48000
2  Carlos    22   Valencia    41000
3    Sara    27     Bilbao    35000

In [6]:
nombres = df['Nombre']
nombres

0       Ana
1      Luis
2    Carlos
3      Sara
Name: Nombre, dtype: object

In [7]:
rucos = df[df['Edad'] > 25]
rucos

  Nombre  Edad     Ciudad  Salario
1   Luis    30  Barcelona    48000
3   Sara    27     Bilbao    35000

In [8]:
type(df)

pandas.core.frame.DataFrame

In [9]:
type(df['Edad'])

pandas.core.series.Series

**VIDEO 2**

In [10]:
import pandas as pd

df = pd.read_csv('topPeliculas.csv')
df.head()

,indice_global,indice_estricto,título,director,año,duración,género,rating,metascore,recaudación(M)
0,0,0.0,The Shawshank Redemption,Frank Darabont,1994.0,142.0,Drama,9.3,82.0,28.34
1,1,1.0,The Godfather,Francis Ford Coppola,1972.0,175.0,Crimen,9.2,100.0,134.97
2,2,1.0,The Godfather,Francis Ford Coppola,1972.0,175.0,Drama,9.2,100.0,134.97
3,3,2.0,The Dark Knight,Christopher Nolan,2008.0,152.0,Acción,9.0,84.0,534.86
4,4,2.0,The Dark Knight,Christopher Nolan,2008.0,152.0,Crimen,9.0,84.0,534.86

In [11]:
df_ordenado = df.sort_values(by='rating')
df_ordenado.head()

,indice_global,indice_estricto,título,director,año,duración,género,rating,metascore,recaudación(M)
2531,2531,999.0,Cell 211,Daniel MonzÃ³n,2009.0,113.0,Drama,7.6,0.0,0.0
2530,2530,999.0,Cell 211,Daniel MonzÃ³n,2009.0,113.0,Crimen,7.6,0.0,0.0
2529,2529,999.0,Cell 211,Daniel MonzÃ³n,2009.0,113.0,Acción,7.6,0.0,0.0
2528,2528,998.0,The Invisible Man,James Whale,1933.0,71.0,Ciencia Ficción,7.6,87.0,0.0
2495,2495,986.0,From Here to Eternity,Fred Zinnemann,1953.0,118.0,Guerra,7.6,85.0,30.5

In [12]:
df_ordenado = df.sort_values(by='rating', ascending = False)
df_ordenado.head()

,indice_global,indice_estricto,título,director,año,duración,género,rating,metascore,recaudación(M)
0,0,0.0,The Shawshank Redemption,Frank Darabont,1994.0,142.0,Drama,9.3,82.0,28.34
1,1,1.0,The Godfather,Francis Ford Coppola,1972.0,175.0,Crimen,9.2,100.0,134.97
2,2,1.0,The Godfather,Francis Ford Coppola,1972.0,175.0,Drama,9.2,100.0,134.97
5,5,2.0,The Dark Knight,Christopher Nolan,2008.0,152.0,Drama,9.0,84.0,534.86
12,12,5.0,The Lord of the Rings: The Return of the King,Peter Jackson,2003.0,201.0,Aventura,9.0,94.0,377.85

In [13]:
df_ordenado = df.sort_values(by=['rating', 'recaudación(M)'], ascending = False)
df_ordenado.head()

,indice_global,indice_estricto,título,director,año,duración,género,rating,metascore,recaudación(M)
0,0,0.0,The Shawshank Redemption,Frank Darabont,1994.0,142.0,Drama,9.3,82.0,28.34
1,1,1.0,The Godfather,Francis Ford Coppola,1972.0,175.0,Crimen,9.2,100.0,134.97
2,2,1.0,The Godfather,Francis Ford Coppola,1972.0,175.0,Drama,9.2,100.0,134.97
3,3,2.0,The Dark Knight,Christopher Nolan,2008.0,152.0,Acción,9.0,84.0,534.86
4,4,2.0,The Dark Knight,Christopher Nolan,2008.0,152.0,Crimen,9.0,84.0,534.86

In [14]:
df_agrupado = df.groupby('género')['rating'].mean()
df_agrupado

género
Acción             7.987255
Animación          7.943902
Aventura           7.980435
Biografía          7.971698
Ciencia Ficción    7.986567
Comedia            7.909910
Crimen             7.993500
Deportes           7.980000
Drama              7.980444
Familiar           7.932692
Fantasía           7.929508
Film-Noir          7.977273
Guerra             8.053191
Historia           7.931818
Misterio           7.991262
Musica             7.909677
Musical            7.943750
Romance            7.937398
Terror             7.875758
Thriller           7.929286
Western            8.006250
Name: rating, dtype: float64

In [15]:
df_agrupado = df.groupby('año')['recaudación(M)'].sum()
df_agrupado.sort_values(ascending=False).head(10)

año
2014.0    8015.90
2019.0    7092.95
2010.0    6899.96
2016.0    6860.23
2015.0    6817.12
2012.0    6487.22
2009.0    6486.34
2018.0    5992.02
2008.0    5603.30
2017.0    5381.90
Name: recaudación(M), dtype: float64

In [16]:
import pandas as pd 

datos = {
    'titulo': ['Pelicula A', 'Pelicula B', 'Pelicula C', 'Pelicula D'],
    'año': [2001, 2000, 2005, 2010],
    'rating': [7.2, 6.5, 8.1, 7.5]
}

df = pd.DataFrame(datos)
df_ordenado = df.sort_values(by='año')
df_ordenado.head()

       titulo   año  rating
1  Pelicula B  2000     6.5
0  Pelicula A  2001     7.2
2  Pelicula C  2005     8.1
3  Pelicula D  2010     7.5

In [17]:
import pandas as pd 

datos = {
    'titulo': ['Pelicula A', 'Pelicula B', 'Pelicula C', 'Pelicula D'],
    'año': [2001, 2000, 2005, 2010],
    'rating': [7.2, 6.5, 8.1, 7.5]
}

df = pd.DataFrame(datos)
df_ordenado = df.sort_values(by='rating')
df_ordenado = df.sort_values(by='año', ascending=False)
df_ordenado.head()

       titulo   año  rating
3  Pelicula D  2010     7.5
2  Pelicula C  2005     8.1
0  Pelicula A  2001     7.2
1  Pelicula B  2000     6.5

In [18]:
import pandas as pd 
datos = {
    'titulo': ['Pelicula A', 'Pelicula B', 'Pelicula C', 'Pelicula D', 'Pelicula E'],
    'género': ['Acción', 'Drama', 'Acción', 'Comedia', 'Drama'],
    'rating': [7.2, 8.5, 9.1, 6.5, 7.8]
}

df = pd.DataFrame(datos)

promedio_rating_por_genero = df.groupby('género')['rating'].mean()

print(promedio_rating_por_genero)

género
Acción     8.15
Comedia    6.50
Drama      8.15
Name: rating, dtype: float64

**VIDEO 3**

In [19]:
import pandas as pd

df1 = pd.DataFrame({'ID': [1,2,3], 'Nombre': ['Ana', 'Luis', 'Carlos']})
df2 = pd.DataFrame({'ID': [1,2,4], 'Edad': [25,30,22]})
df1

   ID  Nombre
0   1     Ana
1   2    Luis
2   3  Carlos

In [20]:
df2

   ID  Edad
0   1    25
1   2    30
2   4    22

In [21]:
df_Combinado = pd.merge(df1, df2, on='ID')
df_Combinado

   ID Nombre  Edad
0   1    Ana    25
1   2   Luis    30

In [22]:
df_Combinado = pd.merge(df1, df2, on='ID', how='outer')
df_Combinado

   ID  Nombre  Edad
0   1     Ana  25.0
1   2    Luis  30.0
2   3  Carlos   NaN
3   4     NaN  22.0

In [23]:
df_indexado = pd.merge(df1, df2, left_index=True, right_index=True)
df_indexado

   ID_x  Nombre  ID_y  Edad
0     1     Ana     1    25
1     2    Luis     2    30
2     3  Carlos     4    22

In [24]:
import pandas as pd 

cursos = pd.DataFrame({
    'curso_id': [101, 102, 103],
    'nombre_curso': ['Introducción a Python', 'Data Science con Python', 'Machine Learning Avanzado']
})

inscripciones = pd.DataFrame({
    'curso_id': [102, 102, 101, 104],
    'fecha_inscripcion': ['2023-01-15', '2023-02-01', '2023-01-20', '2023-03-05']
})


cursos_inscripciones = pd.merge(cursos, inscripciones, on='curso_id', how='left')
print(cursos_inscripciones)

   curso_id               nombre_curso fecha_inscripcion
0       101      Introducción a Python        2023-01-20
1       102    Data Science con Python        2023-01-15
2       102    Data Science con Python        2023-02-01
3       103  Machine Learning Avanzado               NaN

In [25]:


productos = pd.DataFrame({
    'ID': [10, 11, 12],
    'Nombre': ['Teclado', 'Mouse', 'Monitor'],
    'Marca': ['Logitech', 'Razer', 'Dell']
})

reviews = pd.DataFrame({
    'ID': [10, 11, 12],
    'Calificación': [5, 4, 4],
    'Comentario': ['Excelente producto', 'Buen producto', 'Satisfecho']
})

productos_reviews = pd.merge(productos, reviews, on='ID', how='left')

productos_reviews

   ID   Nombre     Marca  Calificación          Comentario
0  10  Teclado  Logitech             5  Excelente producto
1  11    Mouse     Razer             4       Buen producto
2  12  Monitor      Dell             4          Satisfecho

**VIDEO 4**

In [26]:
import pandas as pd

df1 = pd.DataFrame({'Salario': [30000, 45000, 38000], 
                    'Antiguedad':[9,13,12]}, index=[1,2,3])

df2 = pd.DataFrame({'Ciudad': ['Madrid', 'Barcelona', 'Valencia'], 
                    'Jerarquia':['Baja', 'Alta', 'Media']}, index=[1,2,4])

In [27]:
df1

   Salario  Antiguedad
1    30000           9
2    45000          13
3    38000          12

In [28]:
df2

      Ciudad Jerarquia
1     Madrid      Baja
2  Barcelona      Alta
4   Valencia     Media

In [29]:
df_unido = df1.join(df2)
df_unido

   Salario  Antiguedad     Ciudad Jerarquia
1    30000           9     Madrid      Baja
2    45000          13  Barcelona      Alta
3    38000          12        NaN       NaN

In [30]:
df_unido = df1.join(df2, how='inner')
df_unido

   Salario  Antiguedad     Ciudad Jerarquia
1    30000           9     Madrid      Baja
2    45000          13  Barcelona      Alta

In [31]:
import pandas as pd


productos_df = pd.DataFrame({
    'ProductoID': [1, 2, 3, 4],
    'Nombre': ['Producto 1', 'Producto 2', 'Producto 3', 'Producto 4'],
    'Precio': [100, 150, 200, 250]
})



productos_df = productos_df.set_index('ProductoID')



categorias_df = pd.DataFrame({
    'CategoriaID': [1, 2, 3],
    'NombreCategoria': ['Categoría 1', 'Categoría 2', 'Categoría 3']
}).set_index('CategoriaID')


df_combinado = productos_df.join(categorias_df, how='right')

df_combinado

                 Nombre  Precio NombreCategoria
CategoriaID
1            Producto 1     100     Categoría 1
2            Producto 2     150     Categoría 2
3            Producto 3     200     Categoría 3

**VIDEO 5**

In [32]:
import pandas as pd

In [33]:
df1 = pd.DataFrame({'Nombre': ['Juan', 'Gabriela', 'Elena'], 'Edad':[23,31,21]})
df1

     Nombre  Edad
0      Juan    23
1  Gabriela    31
2     Elena    21

In [34]:
df2 = pd.DataFrame({'Nombre': ['Carmela', 'Max', 'Laura'], 'Edad':[34,25,29]})
df2

    Nombre  Edad
0  Carmela    34
1      Max    25
2    Laura    29

In [35]:
dfConcatenado = pd.concat([df1, df2])
dfConcatenado

     Nombre  Edad
0      Juan    23
1  Gabriela    31
2     Elena    21
0   Carmela    34
1       Max    25
2     Laura    29

In [36]:
dfConcatenado2 = pd.concat([df1, df2], axis=1)
dfConcatenado2

     Nombre  Edad   Nombre  Edad
0      Juan    23  Carmela    34
1  Gabriela    31      Max    25
2     Elena    21    Laura    29

In [37]:
dfConcatenado = pd.concat([df1, df2], ignore_index=True)
dfConcatenado

     Nombre  Edad
0      Juan    23
1  Gabriela    31
2     Elena    21
3   Carmela    34
4       Max    25
5     Laura    29

In [38]:
dfConcatenado = pd.concat([df1, df2], keys=['df1', 'df2'])
dfConcatenado

         Nombre  Edad
df1 0      Juan    23
    1  Gabriela    31
    2     Elena    21
df2 0   Carmela    34
    1       Max    25
    2     Laura    29

In [39]:
dfConcatenado = pd.concat([df1, df2], keys=['enero', 'febrero'])
dfConcatenado

             Nombre  Edad
enero   0      Juan    23
        1  Gabriela    31
        2     Elena    21
febrero 0   Carmela    34
        1       Max    25
        2     Laura    29

**VIDEO 6**

In [40]:
import pandas as pd

fechas = pd.Series(pd.date_range('20240101', periods=6))
fechas

0   2024-01-01
1   2024-01-02
2   2024-01-03
3   2024-01-04
4   2024-01-05
5   2024-01-06
dtype: datetime64[ns]

In [41]:
type(fechas[0])

pandas._libs.tslibs.timestamps.Timestamp

In [42]:
fechas = pd.Series(pd.date_range('20240101', periods=6, freq='D'))
fechas

0   2024-01-01
1   2024-01-02
2   2024-01-03
3   2024-01-04
4   2024-01-05
5   2024-01-06
dtype: datetime64[ns]

In [43]:
fechas = pd.Series(pd.date_range('20240101', periods=6, freq='M'))
fechas

C:\Users\pestrm1\AppData\Local\Temp\ipykernel_24512\661938073.py:1: FutureWarning: 'M' is deprecated and will be removed in a future version, please use 'ME' instead.
  fechas = pd.Series(pd.date_range('20240101', periods=6, freq='M'))

0   2024-01-31
1   2024-02-29
2   2024-03-31
3   2024-04-30
4   2024-05-31
5   2024-06-30
dtype: datetime64[ns]

In [44]:
fechas = pd.Series(pd.date_range('20240101', periods=6, freq='Y'))
fechas

C:\Users\pestrm1\AppData\Local\Temp\ipykernel_24512\2898099646.py:1: FutureWarning: 'Y' is deprecated and will be removed in a future version, please use 'YE' instead.
  fechas = pd.Series(pd.date_range('20240101', periods=6, freq='Y'))

0   2024-12-31
1   2025-12-31
2   2026-12-31
3   2027-12-31
4   2028-12-31
5   2029-12-31
dtype: datetime64[ns]

In [45]:
fechas = pd.Series(pd.date_range('20240101', periods=6, freq='H'))
fechas

C:\Users\pestrm1\AppData\Local\Temp\ipykernel_24512\3246372151.py:1: FutureWarning: 'H' is deprecated and will be removed in a future version, please use 'h' instead.
  fechas = pd.Series(pd.date_range('20240101', periods=6, freq='H'))

0   2024-01-01 00:00:00
1   2024-01-01 01:00:00
2   2024-01-01 02:00:00
3   2024-01-01 03:00:00
4   2024-01-01 04:00:00
5   2024-01-01 05:00:00
dtype: datetime64[ns]

In [46]:
fechas = pd.Series(pd.date_range('20240101', periods=6, freq='MIN'))
fechas

C:\Users\pestrm1\AppData\Local\Temp\ipykernel_24512\898040804.py:1: FutureWarning: 'MIN' is deprecated and will be removed in a future version, please use 'min' instead.
  fechas = pd.Series(pd.date_range('20240101', periods=6, freq='MIN'))

0   2024-01-01 00:00:00
1   2024-01-01 00:01:00
2   2024-01-01 00:02:00
3   2024-01-01 00:03:00
4   2024-01-01 00:04:00
5   2024-01-01 00:05:00
dtype: datetime64[ns]

In [47]:
fechas = pd.Series(pd.date_range('20240101', periods=6, freq='5D'))
fechas

0   2024-01-01
1   2024-01-06
2   2024-01-11
3   2024-01-16
4   2024-01-21
5   2024-01-26
dtype: datetime64[ns]

In [48]:
import pandas as pd

df = pd.read_csv('mercadoValoresEspaña.csv')
df

,Ticker,Fecha,Cierre,Referencia,Volumen,Rotacion,Ultimo,Alto,Bajo,Promedio
0,ANA,02/01/2019,74.80,73.90,156300,11621188.98,74.80,75.16,72.38,74.3518
1,ANA,03/01/2019,76.34,74.80,140331,10632703.64,76.34,76.60,74.54,75.7687
2,ANA,04/01/2019,76.62,76.34,130309,10010838.76,76.62,77.40,76.40,76.8162
3,ANA,07/01/2019,77.14,76.62,63349,4855724.92,77.14,77.30,75.62,76.6504
4,ANA,08/01/2019,78.24,77.14,99300,7749464.70,78.24,78.46,77.00,78.0409
...,...,...,...,...,...,...,...,...,...,...
8570,VIS,09/12/2019,48.70,48.76,40236,1958325.66,48.70,48.96,48.44,48.6710
8571,VIS,10/12/2019,48.16,48.70,60198,2895965.78,48.16,48.74,47.70,48.1201
8572,VIS,11/12/2019,47.96,48.16,63000,3012462.12,47.96,48.42,47.52,47.8169
8573,VIS,12/12/2019,48.42,47.96,50218,2429199.80,48.42,48.66,47.76,48.3731
8574,VIS,13/12/2019,48.64,48.42,62427,3038685.10,48.64,49.18,48.12,48.6758

In [49]:
df['Fecha'] = pd.to_datetime(df['Fecha'], format='%d/%m/%Y')

In [50]:
df

,Ticker,Fecha,Cierre,Referencia,Volumen,Rotacion,Ultimo,Alto,Bajo,Promedio
0,ANA,2019-01-02,74.80,73.90,156300,11621188.98,74.80,75.16,72.38,74.3518
1,ANA,2019-01-03,76.34,74.80,140331,10632703.64,76.34,76.60,74.54,75.7687
2,ANA,2019-01-04,76.62,76.34,130309,10010838.76,76.62,77.40,76.40,76.8162
3,ANA,2019-01-07,77.14,76.62,63349,4855724.92,77.14,77.30,75.62,76.6504
4,ANA,2019-01-08,78.24,77.14,99300,7749464.70,78.24,78.46,77.00,78.0409
...,...,...,...,...,...,...,...,...,...,...
8570,VIS,2019-12-09,48.70,48.76,40236,1958325.66,48.70,48.96,48.44,48.6710
8571,VIS,2019-12-10,48.16,48.70,60198,2895965.78,48.16,48.74,47.70,48.1201
8572,VIS,2019-12-11,47.96,48.16,63000,3012462.12,47.96,48.42,47.52,47.8169
8573,VIS,2019-12-12,48.42,47.96,50218,2429199.80,48.42,48.66,47.76,48.3731
8574,VIS,2019-12-13,48.64,48.42,62427,3038685.10,48.64,49.18,48.12,48.6758

In [51]:
df['Fecha'][0]

Timestamp('2019-01-02 00:00:00')

In [52]:
type(df['Fecha'][0])

pandas._libs.tslibs.timestamps.Timestamp

In [53]:
df['Fecha'][44]

Timestamp('2019-03-05 00:00:00')

In [54]:
df['Fecha'][44].year

2019

In [55]:
df['Fecha'][44].month

3

In [56]:
df5dias = df['Fecha'] + pd.Timedelta(days=5)
df5dias

0      2019-01-07
1      2019-01-08
2      2019-01-09
3      2019-01-12
4      2019-01-13
          ...
8570   2019-12-14
8571   2019-12-15
8572   2019-12-16
8573   2019-12-17
8574   2019-12-18
Name: Fecha, Length: 8575, dtype: datetime64[ns]

In [57]:
import pandas as pd

# Crear la serie temporal con un rango de fechas
primera_semana_2024 = pd.date_range(start="2024-01-01", end="2024-01-07", freq="D")

# Mostrar la serie temporal
print(primera_semana_2024)

DatetimeIndex(['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04',
               '2024-01-05', '2024-01-06', '2024-01-07'],
              dtype='datetime64[ns]', freq='D')

**VIDEO 7**

In [58]:
import pandas as pd

In [59]:
df1 = pd.read_excel('comprasAds.xlsx')
df1.head()

   Id_usuario     Genero  Edad  Salario_estimado  Comprado
0    15624510  Masculino    19             19000         0
1    15810944  Masculino    35             20000         0
2    15668575   Femenino    26             43000         0
3    15603246   Femenino    27             57000         0
4    15804002  Masculino    19             76000         0

In [60]:
%pip install lxml

Requirement already satisfied: lxml in c:\users\pestrm1\appdata\local\programs\python\python313\lib\site-packages (5.4.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 25.0.1 -> 25.1.1
[notice] To update, run: C:\Users\pestrm1\AppData\Local\Programs\Python\Python313\python.exe -m pip install --upgrade pip

In [61]:
df2 = pd.read_xml('valoresAcciones.xml')
df2.head()

         date closingValue
0  01-05-2023        25,05
1  02-05-2023        24,45
2  03-05-2023        24,45
3  04-05-2023        23,98
4  05-05-2023        24,56

In [62]:
numeros = {
    'romanos': ['I', 'II', 'III', 'IV'],
    'arabigos': [1, 2, 3, 4],
    'texto': ['uno', 'dos', 'tres', 'cuatro']
}

numeros

{'romanos': ['I', 'II', 'III', 'IV'],
 'arabigos': [1, 2, 3, 4],
 'texto': ['uno', 'dos', 'tres', 'cuatro']}

In [63]:
df = pd.DataFrame(numeros)
df

  romanos  arabigos   texto
0       I         1     uno
1      II         2     dos
2     III         3    tres
3      IV         4  cuatro

In [64]:
df['Fechas'] = pd.Series(pd.date_range('20240101', periods=4))

In [65]:
df.to_csv('myCSV.csv')

**VIDEO 8**

In [67]:
import pandas as pd

In [68]:
df = pd.DataFrame({
    'Col1': [100,200,300],
    'Col2': [400,500,600],
    'Col3': [700,800,900]
}, index=['fila1', 'fila2', 'fila3'])

df

       Col1  Col2  Col3
fila1   100   400   700
fila2   200   500   800
fila3   300   600   900

In [69]:
df.loc['fila1']

Col1    100
Col2    400
Col3    700
Name: fila1, dtype: int64

In [70]:
type(df.loc['fila1'])

pandas.core.series.Series

In [71]:
df.loc[['fila1', 'fila3']]

       Col1  Col2  Col3
fila1   100   400   700
fila3   300   600   900

In [72]:
df.loc['fila2':'fila3']

       Col1  Col2  Col3
fila2   200   500   800
fila3   300   600   900

In [73]:
df.loc[[False, True, False]]

       Col1  Col2  Col3
fila2   200   500   800

In [74]:
df.loc[df['Col1'] > 150]

       Col1  Col2  Col3
fila2   200   500   800
fila3   300   600   900

In [75]:
df.loc[:, ['Col1', 'Col2']]

       Col1  Col2
fila1   100   400
fila2   200   500
fila3   300   600

In [76]:
df.iloc[0]

Col1    100
Col2    400
Col3    700
Name: fila1, dtype: int64

In [77]:
df.iloc[:, [0,1]]

       Col1  Col2
fila1   100   400
fila2   200   500
fila3   300   600

In [78]:
df.iloc[1:3]

       Col1  Col2  Col3
fila2   200   500   800
fila3   300   600   900